OpenNuvoton/ISPTool/Firmwares/NUC230_240BSP/Library/Device/Nuvoton/NUC230_240/Include/NUC230_240.h
 * |        |          |This field is used for transfer error interrupt enable.
 * |        |          |The transfer error states is at SC_SR register which includes receiver break error
 * |        |          |RX_EBR_F(SC_SR[6]), frame error RX_EFR_F(SC_SR[5]), parity error RX_EPA_F(SC_SR[4]), receiver
 * |        |          |buffer overflow error RX_OVER_F(SC_SR[0]), transmit buffer overflow error TX_OVER_F(SC_SR[8]),
 * |        |          |receiver retry over limit error RX_OVER_REERR(SC_SR[22]) and transmitter retry over limit error
 * |        |          |TX_OVER_REERR(SC_SR[30]).
 * |        |          |0 = Transfer error interrupt Disabled.
 * |        |          |1 = Transfer error interrupt Enabled.
 * |[3]     |TMR0_IE   |Timer0 Interrupt Enable Control
 * |        |          |This field is used to enable TMR0 interrupt enable.
 * |        |          |0 = Timer0 interrupt Disabled.
 * |        |          |1 = Timer0 interrupt Enabled.
 * |[4]     |TMR1_IE   |Timer1 Interrupt Enable Control
 * |        |          |This field is used to enable the TMR1 interrupt.
 * |        |          |0 = Timer1 interrupt Disabled.
 * |        |          |1 = Timer1 interrupt Enabled.
 * |[5]     |TMR2_IE   |Timer2 Interrupt Enable Control
 * |        |          |This field is used for TMR2 interrupt enable.
 * |        |          |0 = Timer2 interrupt Disabled.
 * |        |          |1 = Timer2 interrupt Enabled.
 * |[6]     |BGT_IE    |Block Guard Time Interrupt Enable Control
 * |        |          |This field is used for block guard time interrupt enable.
 * |        |          |0 = Block guard time Disabled.
 * |        |          |1 = Block guard time Enabled.
 * |[7]     |CD_IE     |Card Detect Interrupt Enable Control
 * |        |          |This field is used for card detect interrupt enable. The card detect status is
 * |        |          |CD_INS_F(SC_SR[12])
 * |        |          |0 = Card detect interrupt Disabled.
 * |        |          |1 = Card detect interrupt Enabled.
 * |[8]     |INIT_IE   |Initial End Interrupt Enable Control
 * |        |          |This field is used for activation (ACT_EN(SC_ALTCTL[3] = 1)), deactivation ((DACT_EN
 * |        |          |SC_ALTCTL[2]) = 1) and warm reset (WARST_EN (SC_ALTCTL [4])) sequence interrupt enable.
 * |        |          |0 = Initial end interrupt Disabled.
 * |        |          |1 = Initial end interrupt Enabled.
 * |[9]     |RTMR_IE   |Receiver Buffer Time-Out Interrupt Enable Control
 * |        |          |This field is used for receiver buffer time-out interrupt enable.
 * |        |          |0 = Receiver buffer time-out interrupt Disabled.
 * |        |          |1 = Receiver buffer time-out interrupt Enabled.
 * |[10]    |ACON_ERR_IE|Auto Convention Error Interrupt Enable Control
 * |        |          |This field is used for auto-convention error interrupt enable.
 * |        |          |0 = Auto-convention error interrupt Disabled.
 * |        |          |1 = Auto-convention error interrupt Enabled.
 * @var SC_T::ISR
 * Offset: 0x1C  SC Interrupt Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |RDA_IS    |Receive Data Reach Interrupt Status Flag (Read Only)
 * |        |          |This field is used for received data reaching trigger level RX_FTRI_LEV (SC_CTL[7:6]) interrupt
 * |        |          |status flag.
 * |        |          |Note: This field is the status flag of received data reaching RX_FTRI_LEV (SC_CTL[7:6]).
 * |        |          |If software reads data from SC_RBR and receiver buffer data byte number is less than RX_FTRI_LEV
 * |        |          |(SC_CTL[7:6]), this bit will be cleared automatically.
 * |[1]     |TBE_IS    |Transmit Buffer Empty Interrupt Status Flag (Read Only)
 * |        |          |This field is used for transmit buffer empty interrupt status flag.
 * |        |          |Note: This field is the status flag of transmit buffer empty state.
 * |        |          |If software wants to clear this bit, software must write data to THR(SC_THR[7:0]) buffer and
 * |        |          |then this bit will be cleared automatically.
 * |[2]     |TERR_IS   |Transfer Error Interrupt Status Flag (Read Only)
 * |        |          |This field is used for transfer error interrupt status flag.
 * |        |          |The transfer error states is at SC_SR register which includes receiver break error
 * |        |          |RX_EBR_F(SC_SR[6]), 
 * |        |          |frame error RX_EFR_F(SC_TRSR[5]), parity error RX_EPA_F(SC_TRSR[4]) and receiver buffer overflow
 * |        |          |error RX_OVER_F(SC_TRSR[0]), 
 * |        |          |transmit buffer overflow error TX_OVER_F(SC_TRSR[8]), receiver retry over limit error
 * |        |          |RX_OVER_REERR(SC_TRSR[22]) and transmitter retry over limit error TX_OVER_REERR(SC_TRSR[30]).
 * |        |          |Note: This field is the status flag of
 * |        |          |RX_EBR_F(SC_TRSR[6]), RX_EFR_F(SC_TRSR[5]), RX_EPA_F(SC_TRSR[4]), RX_OVER_F(SC_TRSR[0]),
 * |        |          |TX_OVER_F(SC_TRSR[8]), RX_OVER_REERR(SC_TRSR[22]) or TX_OVER_REERR(SC_TRSR[30]).
 * |        |          |So, if software wants to clear this bit, software must write 1 to each field.
 * |[3]     |TMR0_IS   |Timer0 Interrupt Status Flag (Read Only)
 * |        |          |This field is used for TMR0 interrupt status flag.
 * |        |          |Note: This bit is read only, but it can be cleared by writing 1 to it.
 * |[4]     |TMR1_IS   |Timer1 Interrupt Status Flag (Read Only)
 * |        |          |This field is used for TMR1 interrupt status flag.
 * |        |          |Note: This bit is read only, but it can be cleared by writing 1 to it.
 * |[5]     |TMR2_IS   |Timer2 Interrupt Status Flag (Read Only)
 * |        |          |This field is used for TMR2 interrupt status flag.
 * |        |          |Note: This bit is read only, but it can be cleared by writing 1 to it.
 * |[6]     |BGT_IS    |Block   Guard Time Interrupt Status Flag (Read Only)
 * |        |          |This field   is used for block guard time interrupt status flag.
 * |        |          |Note1: This bit is valid when RX_BGT_EN   (SC_ALTCTL[12]) is enabled.
 * |        |          |Note2: This bit is read only, but it can be cleared by   writing "1" to it.
 * |[7]     |CD_IS     |Card Detect Interrupt Status Flag (Read Only)
 * |        |          |This field is used for card detect interrupt status flag.
 * |        |          |The card detect status is CD_INS_F (SC_SR[12]) and CD_REM_F(SC_SR[11]).
 * |        |          |Note:
 * |        |          |This field is the status flag of CD_INS_F(SC_SR[12]) or CD_REM_F(SC_TRSR[11])].
 * |        |          |So if software wants to clear this bit, software must write 1 to this field.
 * |[8]     |INIT_IS   |Initial End Interrupt Status Flag (Read Only)
 * |        |          |This field is used for activation (ACT_EN(SC_ALTCTL[3])), deactivation (DACT_EN (SC_ALTCTL[2]))
 * |        |          |and warm reset (WARST_EN (SC_ALTCTL[4])) sequence interrupt status flag.
 * |        |          |Note: This bit is read only, but it can be cleared by writing 1 to it.
 * |[9]     |RTMR_IS   |Receiver Buffer Time-Out Interrupt Status Flag (Read Only)
 * |        |          |This field is used for receiver buffer time-out interrupt status flag.
 * |        |          |Note: This field is the status flag of receiver buffer time-out state.
 * |        |          |If software wants to clear this bit, software must read all receiver buffer remaining data by
 * |        |          |reading SC_RBR buffer,.
 * |[10]    |ACON_ERR_IS|Auto Convention Error Interrupt Status Flag (Read Only)
 * |        |          |This field indicates auto convention sequence error.
 * |        |          |If the received TS at ATR state is neither 0x3B nor 0x3F, this bit will be set.
 * |        |          |Note: This bit is read only, but it can be cleared by writing 1 to it.
 * @var SC_T::TRSR
 * Offset: 0x20  SC Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |RX_OVER_F |RX Overflow Error Status Flag (Read Only)
 * |        |          |This bit is set when RX buffer overflow.
 * |        |          |If the number of received bytes is greater than Rx Buffer size (4 bytes), this bit will be set.
 * |        |          |Note: This bit is read only, but it can be cleared by writing 1 to it.
 * |[1]     |RX_EMPTY_F|Receiver Buffer Empty Status Flag(Read Only)
 * |        |          |This bit indicates RX buffer empty or not.
 * |        |          |When the last byte of Rx buffer has been read by CPU, hardware sets this bit high.
 * |        |          |It will be cleared when SC receives any new data.
 * |[2]     |RX_FULL_F |Receiver Buffer Full Status Flag (Read Only)
 * |        |          |This bit indicates RX buffer full or not.
 * |        |          |This bit is set when RX pointer is equal to 4, otherwise it is cleared by hardware.
 * |[4]     |RX_EPA_F  |Receiver Parity Error Status Flag (Read Only)
 * |        |          |This bit is set to logic 1 whenever the received character does not have a valid
 * |        |          |"parity bit".
 * |        |          |Note1:
 * |        |          |This bit is read only, but it can be cleared by writing 1 to it.
 * |        |          |Note2:
 * |        |          |If CPU sets receiver retries function by setting RX_ERETRY_EN(SC_CTL[19]) , hardware will not
 * |        |          |set this flag.
 * |[5]     |RX_EFR_F  |Receiver Frame Error Status Flag (Read Only)
 * |        |          |This bit is set to logic 1 whenever the received character does not have a valid "stop bit"
 * |        |          |(that is, the stop bit following the last data bit or parity bit is detected as logic 0).
 * |        |          |Note1:
 * |        |          |This bit is read only, but it can be cleared by writing 1 to it.
 * |        |          |Note2:
 * |        |          |If CPU sets receiver retries function by setting RX_ERETRY_EN(SC_CTL[19]) , hardware will not
 * |        |          |set this flag.
 * |[6]     |RX_EBR_F  |Receiver Break Error Status Flag (Read Only)
 * |        |          |This bit is set to logic 1 whenever the received data input (RX) held in the "spacing state"
 * |        |          |(logic 0) is longer than a full word transmission time (that is, the total time of "start bit" +
 * |        |          |data bits + parity + stop bits).
 * |        |          |Note1:
 * |        |          |This bit is read only, but it can be cleared by writing 1 to it.
 * |        |          |Note2:
 * |        |          |If CPU sets receiver retries function by setting RX_ERETRY_EN(SC_CTL[19]) , hardware will not
 * |        |          |set this flag.
 * |[8]     |TX_OVER_F |TX Overflow Error Interrupt Status Flag (Read Only)
 * |        |          |If TX buffer is full, an additional write to THR(SC_THR[7:0]) will cause this bit be set to "1"
 * |        |          |by hardware.
 * |        |          |Note: This bit is read only, but it can be cleared by writing 1 to it.
 * |[9]     |TX_EMPTY_F|Transmit Buffer Empty Status Flag (Read Only)
 * |        |          |This bit indicates TX buffer empty or not.
 * |        |          |When the last byte of TX buffer has been transferred to Transmitter Shift Register, hardware
 * |        |          |sets this bit high.
 * |        |          |It will be cleared when writing data into THR(SC_THR[7:0]) (TX buffer not empty).
 * |[10]    |TX_FULL_F |Transmit Buffer Full Status Flag (Read Only)
 * |        |          |This bit indicates TX buffer full or not.This bit is set when TX pointer is equal to 4,
 * |        |          |otherwise is cleared by hardware.
 * |[17:16] |RX_POINT_F|Receiver Buffer Pointer Status Flag (Read Only)
 * |        |          |This field indicates the RX buffer pointer status flag.
 * |        |          |When SC receives one byte from external device, RX_POINT_F(SC_SR[17:16]) increases one.
 * |        |          |When one byte of RX buffer is read by CPU, RX_POINT_F(SC_SR[17:16]) decreases one.
 * |[21]    |RX_REERR  |Receiver Retry Error (Read Only)
 * |        |          |This bit is set by hardware when RX has any error and retries transfer.
 * |        |          |Note1: This bit is read only, but it can be cleared by writing 1 to it.
 * |        |          |Note2 This bit is a flag and cannot generate any interrupt to CPU.
 * |        |          |Note3: If CPU enables receiver retry function by setting RX_ERETRY_EN
 * |        |          |(SC_CTL[19]) , the RX_EPA_F(SC_TRSR[4]) flag will be ignored (hardware will not set
 * |        |          |RX_EPA_F(SC_TRSR[4])).
 * |[22]    |RX_OVER_REERR|Receiver Over Retry Error (Read Only)
 * |        |          |This bit is set by hardware when RX transfer error retry over retry number limit.
 * |        |          |Note1: This bit is read only, but it can be cleared by writing 1 to it.
 * |        |          |Note2: If CPU enables receiver retries function by setting RX_ERETRY_EN
 * |        |          |(SC_CTL[19]), the RX_EPA_F(SC_TRSR[4]) flag will be ignored (hardware will not set
 * |        |          |RX_EPA_F(SC_TRSR[4])).
 * |[23]    |RX_ATV    |Receiver In Active Status Flag (Read Only)
 * |        |          |This bit is set by hardware when RX transfer is in active.
 * |        |          |This bit is cleared automatically when RX transfer is finished.
 * |[25:24] |TX_POINT_F|Transmit Buffer Pointer Status Flag (Read Only)
 * |        |          |This field indicates the TX buffer pointer status flag.
 * |        |          |When CPU writes data into SC_THR, TX_POINT_F increases one.
 * |        |          |When one byte of TX Buffer is transferred to transmitter shift register, TX_POINT_F decreases
 * |        |          |one.
 * |[29]    |TX_REERR  |Transmitter Retry Error (Read Only)
 * |        |          |This bit is set by hardware when transmitter re-transmits.
 * |        |          |Note1: This bit is read only, but it can be cleared by writing 1 to it.
 * |        |          |Note2 This bit is a flag and cannot generate any interrupt to CPU.
 * |[30]    |TX_OVER_REERR|Transmitter Over Retry Error (Read Only)
 * |        |          |This bit is set by hardware when transmitter re-transmits over retry number limitation.
 * |        |          |Note: This bit is read only, but it can be cleared by writing 1 to it.
 * |[31]    |TX_ATV    |Transmit In Active Status Flag (Read Only)
 * |        |          |0 = This bit is cleared automatically when TX transfer is finished or the last byte transmission
 * |        |          |has completed.
 * |        |          |1 = This bit is set by hardware when TX transfer is in active and the STOP bit of the last byte
 * |        |          |has been transmitted.
 * @var SC_T::PINCSR
 * Offset: 0x24  SC Pin Control State Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |POW_EN    |SC_POW_EN Pin Signal
 * |        |          |Software can set POW_EN (SC_PINCSR[0]) and POW_INV (SC_PINCSR[11])to decide SC_PWR pin is in
 * |        |          |high or low level.
 * |        |          |Write this field to drive SC_PWR pin
 * |        |          |Refer POW_INV (SC_PINCSR[11]) description for programming SC_PWR pin voltage level.
 * |        |          |Read this field to get SC_PWR pin status.
 * |        |          |0 = SC_PWR pin status is low.
 * |        |          |1 = SC_PWR pin status is high.
 * |        |          |Note: When operating at activation, warm reset or deactivation mode, this bit will be changed
 * |        |          |automatically.
 * |        |          |So don't fill this field when operating in these modes.
 * |[1]     |SC_RST    |SC_RST Pin Signal
 * |        |          |This bit is the pin status of SC_RST but user can drive SC_RST pin to high or low by setting
 * |        |          |this bit.
 * |        |          |Write this field to drive SC_RST pin.
 * |        |          |0 = Drive SC_RST pin to low.
 * |        |          |1 = Drive SC_RST pin to high.
 * |        |          |Read this field to get SC_RST pin status.
 * |        |          |0 = SC_RST pin status is low.
 * |        |          |1 = SC_RST pin status is high.
 * |        |          |Note: When operating at activation, warm reset or deactivation mode, this bit will be changed
 * |        |          |automatically.
 * |        |          |So don't fill this field when operating in these modes.
 * |[2]     |CD_REM_F  |Card Detect Removal Status Of SC_CD Pin (Read Only)
 * |        |          |This bit is set whenever a card has been removed.
 * |        |          |0 = No effect.
 * |        |          |1 = Card removed.
 * |        |          |Note1: This bit is read only, but it can be cleared by writing "1" to it.
 * |        |          |Note2: Card detect engine will start after SC_CEN (SC_CTL[0] )set.
 * |[3]     |CD_INS_F  |Card Detect Insert Status Of SC_CD Pin (Read Only)
 * |        |          |This bit is set whenever card has been inserted.
 * |        |          |0 = No effect.
 * |        |          |1 = Card insert.
 * |        |          |Note1: This bit is read only, but it can be cleared by writing "1" to it.
 * |        |          |Note2: The
 * |        |          |card detect engine will start after SC_CEN (SC_CTL[0] )set.
 * |[4]     |CD_PIN_ST |Card Detect Status Of SC_CD Pin Status (Read Only)
 * |        |          |This bit is the pin status flag of SC_CD
 * |        |          |0 = The SC_CD pin state at low.
 * |        |          |1 = The SC_CD pin state at high.
 * |[6]     |CLK_KEEP  |SC Clock Enable Control
 * |        |          |0 = SC clock generation Disabled.
 * |        |          |1 = SC clock always keeps free running.
 * |        |          |Note: When operating in activation, warm reset or deactivation mode, this bit will be changed
 * |        |          |automatically.
 * |        |          |So don't fill this field when operating in these modes.
 * |[7]     |ADAC_CD_EN|Auto Deactivation When Card Removal
 * |        |          |0 = Auto deactivation Disabled when hardware detected the card removal.
 * |        |          |1 = Auto deactivation Enabled when hardware detected the card removal.
 * |        |          |Note: When the card is removed, hardware will stop any process and then do deactivation sequence
 * |        |          |(if this bit be setting).
 * |        |          |If this process completes.
 * |        |          |Hardware will generate an initial end.
 * |        |          |interrupt to CPU.
 * |[8]     |SC_OEN_ST |SC Data Output Enable Pin Status (Read Only)
 * |        |          |This bit is the pin status of SC_DATA_OEN
 * |        |          |0 = The SC_DATA_OEN pin state at low.
 * |        |          |1 = The SC_DATA_OEN pin state at high.
 * |[9]     |SC_DATA_O |SC Data Output Pin
 * |        |          |This bit is the pin status of SC_DATA_O but user can drive SC_DATA_O pin to high or low by
 * |        |          |setting this bit.
 * |        |          |0 = Drive SC_DATA_O pin to low.
 * |        |          |1 = Drive SC_DATA_O pin to high.
 * |        |          |Note: When SC is at activation, warm reset or deactivation mode, this bit will be changed
 * |        |          |automatically.
 * |        |          |So don't fill this field when SC is in these modes.
 * |[10]    |CD_LEV    |Card Detect Level
 * |        |          |0 = When hardware detects the card detect pin from high to low, it indicates a card is detected.
 * |        |          |1 = When hardware detects the card detect pin from low to high, it indicates a card is detected.
 * |        |          |Note: Software must select card detect level before Smart Card engine is enabled
 * |[11]    |POW_INV   |SC_POW Pin Inverse
 * |        |          |This bit is used for inverse the SC_POW pin.
 * |        |          |There are four kinds of combination for SC_POW pin setting by POW_INV(SC_PINCSR[11]) and
 * |        |          |POW_EN(SC_PINCSR[0]).
 * |        |          |POW_INV (SC_PINCSR[11]) is bit 1 and POW_EN(SC_PINCSR[0]) is bit 0 for SC_POW_Pin as high or low
 * |        |          |voltage selection.
 * |        |          |00 = SC_POW_ Pin is 0.
 * |        |          |01 = SC_POW _Pin is 1.
 * |        |          |10 = SC_POW _Pin is 1.
 * |        |          |11 = SC_POW_ Pin is 0.
 * |        |          |Note: Software must select POW_INV (SC_PINCSR[11]) before Smart Card is enabled by SC_CEN
 * |        |          |(SC_CTL[0]).
 * |[16]    |SC_DATA_I_ST|SC Data Pin Status (Read Only)
 * |        |          |This bit is the pin status of SC_DATA
 * |        |          |0 = The SC_DATA pin is low.
 * |        |          |1 = The SC_DATA pin is high.
 * |[30]    |SYNC      |SYNC Flag Indicator
 * |        |          |Due to synchronization, software should check this bit when writing a new value to SC_PINCSR
 * |        |          |register.
 * |        |          |0 = Synchronizing is completion, user can write new data to SC_PINCSR register.
 * |        |          |1 = Last value is synchronizing.
 * |        |          |Note: This bit is read only.
 * @var SC_T::TMR0
 * Offset: 0x28  SC Internal Timer Control Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[23:0]  |CNT0      |Timer 0 Counter Value (ETU Base)
 * |        |          |This field indicates the internal timer operation values.
 * |[27:24] |MODE      |Timer 0 Operation Mode Selection
 * |        |          |This field indicates the internal 24-bit timer operation selection.
 * |        |          |Refer to 5.15.5.4 for programming Timer0
 * @var SC_T::TMR1
 * Offset: 0x2C  SC Internal Timer Control Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |CNT1      |Timer 1 Counter Value (ETU Base)
 * |        |          |This field indicates the internal timer operation values.
 * |[27:24] |MODE      |Timer 1 Operation Mode Selection
 * |        |          |This field indicates the internal 8-bit timer operation selection.
 * |        |          |Refer to 5.15.5.4 for programming Timer1
 * @var SC_T::TMR2
 * Offset: 0x30  SC Internal Timer Control Register 2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |CNT2      |Timer 2 Counter Value (ETU Base)
 * |        |          |This field indicates the internal timer operation values.
 * |[27:24] |MODE      |Timer 2 Operation Mode Selection
 * |        |          |This field indicates the internal 8-bit timer operation selection
 * |        |          |Refer to 5.15.5.4 for programming Timer2
 * @var SC_T::UACTL
 * Offset: 0x34  SC UART Mode Control Register.
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |UA_MODE_EN|UART Mode Enable Control
 * |        |          |0 = Smart Card mode.
 * |        |          |1 = UART mode.
 * |        |          |Note1: When operating in UART mode, user must set CON_SEL (SC_CTL[5:4]) = 00 and
 * |        |          |AUTO_CON_EN(SC_CTL[3]) = 0.
